"""Словари ( dict )"""
"""Словарь - это набор неупорядоченных пар ключ:значение,
в котором ключи уникальны"""

d = {}
d = {'Pb':'свинец', 'Au':'Золото'}
print(d['Pb']) # достать занчение по ключу
print(d.get('Pb')) # получить информацию по ключу, если
# ключ есть, но если ключа нет, то ошибки нет, получаем 'None'
print(d.get('Pb1', 'Нужный объект'))

d['Pb'] = 'Свинец' #переопределили значение по ключу
d['Fe'] = 'Железо' # добавили новую пару в словарь
print(d)

d.setdefault('Pb', 22)
# защищает от присвоения значения какого-либо по существующему ключу
n = d.setdefault(2, 22) # создало новую пару по несущ ключу
# метод возвращает значение по этому ключу
print(d, n)

d.update({3:33, 2:222})
key = 'Pb'
print(d[key])
n = d.pop('Fe') # удаляет пару по ключу
nn = d.popitem() # удаляет последнюю добавленную пару
# пара возвращается в виде кортежа
print(n, nn)
print(d)

print(list(d.keys()))
print(list(d))
print(list(d.values()))
print(list(d.items())) # список вложенных кортежей пар
for k in d: # d по умолчанию смотрит ключи
    print(k)

for v in d.values():
    print(v)

for k, v in d.items():
    print(k, v)

l = [22, 33, 44]
dd = dict.fromkeys(l, 'my item')
print(dd)
dd = {i: i**2 for i in range(10, 20)}
print(dd)
ls = [('Pb1', 'Свинец'), ('Au1', 'Золото'), (21, 22)]
dd = dict(ls)
print(dd)
