#s = 'Здравствуйте, \'гости\'!' # экранирование
"""   0123456789  """

#s = 'ЗдраВствуйте, гости!'
# print(s[9])
# print(s[:12])  # обрезать строку от начала ДО 12 символа (не вкл)
# print(s[4::-1]) # с ШАГОМ -1
# print(s[::-1])  # инверсия
# s1 = 'казак'
# for i in range(len(s)):
#     print(i, s[i], end='   ')
# print()
# print(s)
# print(len(s))

# for i in s:
#     print(i, end="  ")
# print(len(s))
# 101 = 1 * 2 ** 2 + 2 ** 0 = 5
# if s1 == s1[::-1]:
#     print("Да")
# else:
#     print("Нет")

s = 'ЗдраВствуйте, гости!'
s1 = '12345678a'
print(s.isalpha()) # метод, опр сост строка только из букв
print(s1.isdigit()) # из чисел
print(s1.isalnum()) # из букв и/или чисел
print(s.isupper()) # все ли буквы большие
print(s.islower()) # все ли буквы маленькие
print(s.isspace()) # является ли строка пробелом(ами)
print(s.startswith('ЗдраВ')) # начинается ли строка с такой подстроки
print('раВ' in s) # входит ли подстрока в строку (T/F)
print(s.endswith('!')) # заканчивается ли строка на подстроку

s1 = s.lower()
print(s, s1)
print(s.upper())
#s = '\033[4mЗдраВствуйте, гости!\033[0m' # спец код для нижн подчеркивания
print(s)
print(s.title()) # каждок слово с больш буквы
# удобно для введения ФИО
print(s.capitalize()) # первая буква в строке больш, ост мал
print(s.center(40)) # строка занимает 40 симв выравн по центру
print(s.rjust(40)) # выравн по прав краю
print(s.ljust(40)) # выравн по лев краю
print(s.swapcase()) # помен мал на больш и наоборот
print(s.strip()) # пробелы ПО КРАЯМ удаляются
print(s.strip('! Зу')) # удаляет по краям, если там есть символы в скобках
print(s.rstrip('!')) # удаляет данные по прав краю
print(s.lstrip('З')) # удаляет данные по лев краю
print(s.index('т')) # индекс буквы т (первой)
print(s.index('т', 7, 11)) # индекс буквы т
# будет ошибка, если подстрока не найдена в диапазоне
print(s.find('т', 0, 20))
# если нет, то будет возвращено значение -1
# если да, о будет только индекс первой буквы т
print(s.replace('т', 'Т', 2)) # мал т замен на больш, только 2 замены
print(s.replace('т', 'Т', 2).replace(',','.'))
ls = s.split() # переводит строку в коллекцию по разделителю
# разбили по пробелу
print(ls) # будет список
ls = s.split(', ')
print(ls)
print(', '.join(ls)) # соединит строковые элементы коллекции в строку через разделитель

s1 = 'aaa bbb ccc ddd eee '
s2 = '111 222 333 444 555'
res = ''
# получить 'aaa 111 bbb 222 ccc 333 ddd 444'
for i in range(0, len(s1), 4):
    res += s1[i:i+4] + s2[i:i+4]
print(res)

#s3 = '-13x^2+4x-6=0'
s3 = 'x^2-x=0'
ind_a = s3.find('x^2', 0, len(s3))
a = s3[:ind_a]
if a == '':
    a = 1
elif a == '-':
    a = -1
else: a = int(s3[:ind_a])
ind_b = s3.find('x', ind_a+1, len(s3))
b = s3[ind_a+3:ind_b]
if b == '+':
    b = 1
elif b == '-':
    b = -1
else: b = int(s3[ind_a+3:ind_b])
ind_c = s3.find('=', ind_b+1, len(s3))
c = s3[ind_b + 1:ind_c]
if c != '':
    c = int(s3[ind_b + 1:ind_c])
else:
    c = 0
d = b ** 2 - 4 * a * c
print('D =', d)
if d < 0:
    print ('D < 0. Уравнение не имеет действительных корней')
if d == 0:
    x12 = -b / 2 * a
    print('D = 0, уравнение имеет один действительный корень')
    print ('x12 = ', x12)
if d > 0:
    x1 = (-b + d ** (1/2)) / (2 * a)
    x2 = (-b - d ** (1/2)) / (2 * a)
    print('D > 0, уравнение имеет два действительных корня')
    print(x1, x2)

